namespace NosiYa.Data.Configurations
{
	using Microsoft.EntityFrameworkCore;
    using Microsoft.EntityFrameworkCore.Metadata.Builders;

    using Models;
    using static Common.SeedingConstants;

    public class EventEntityConfiguration : IEntityTypeConfiguration<Event>
    {
        public void Configure(EntityTypeBuilder<Event> builder)
        {
            builder.HasData(this.CreateEvent());
        }

        private Event[] CreateEvent()
        {
            return new Event[]
            {
                new Event
                {
                    Id = 1,
                    Name = "Фестивал на фолклорната носия - Жеравна",
                    Description = "Фестивалът е създаден през 2008 година по идея на Христо Димитров – продуцент, хореограф и режисьор на Национален фолклорен ансамбъл „Българе”. Атрактивната им сватба с фолклорната певица Албена Вескова през 2005 г. в местността \"Костина\" край с. Рибарица по старинен български обичай, на която младоженците и присъстващите 400 гости са с български народни носии, има широк позитивен отзвук. Това мотивира създателя на „Българе” с помощта на неговите партньори Ян и Елена Андерсон, на тогавашния кмет на Жеравна Лъчезар Германов, бизнесмените Георги Манев и Калин Григоров, както и на други съмишленици, да организира много по-мащабно събитие, което да дава възможност на всеки желаещ поне за три дни в годината да облече българска носия и се откъсне от цивилизацията, като направи скок век и половина назад във времето.",
                    Location = "42.8336195015454, 26.45904413725397",
                    IsApproved = true,
                    OwnerId = Guid.Parse(AdminId),
                    EventStartDate = DateTime.Parse("07-10-2023"),
                    EventEndDate = DateTime.Parse("12-10-2023"),
                },
                new Event
                {
                    Id = 2,
                    Name = "Фестивал на  Жеравна",
                    Description = "Това мотивира създателя на „Българе” с помощта на неговите партньори Ян и Елена Андерсон, на тогавашния кмет на Жеравна Лъчезар Германов, бизнесмените Георги Манев и Калин Григоров, както и на други съмишленици, да организира много по-мащабно събитие, което да дава възможност на всеки желаещ поне за три дни в годината да облече българска носия и се откъсне от цивилизацията, като направи скок век и половина назад във времето.",
                    Location = "42.8336195015454, 26.45904413725397",
                    IsApproved = false,
                    OwnerId = Guid.Parse(UserId),
                    EventStartDate = DateTime.Parse("07-07-2023"),
                    EventEndDate = DateTime.Parse("07-07-2023"),
                },

                new Event
                {
                Id = 73,
                Name = "Международен фолклорен фестивал „Витоша",
                Description = "Местоположение на сцените\r\n\r\nПешеходна зона пред Национален исторически музей, Бояна – 10.07, 11.07, 12.07, 13.07, 14.07 и15.07\r\nКино Кабана – 11.07\r\nс. Владая, НЧ „Светлина – 1906“ – 12.07\r\nкв. Княжево, пл. „Сред село“ – 13.07\r\nкв. Симеоново, НЧ „Отец Паисий“ – 14.07\r\nкв. Драгалевци, ул. „Карнобатски проход“ – 13.07\r\nкв. Бояна, парк „Воденичница“ – 14.07\r\nс. Мърчаево, 152 ОУ – 12.07\r\nМега Мол София, бул. „Царица Йоанна“ № 15 – 15.07",
                Location = "42.652049852021584, 23.26517291652124",
                IsApproved = true,
                OwnerId = Guid.Parse(UserId),
                EventStartDate = DateTime.Parse("27-09-2023"),
                EventEndDate = DateTime.Parse("04-10-2023"),
                },
			};
        }
    }
}
