namespace NosiYa.Data.Configurations.SeedData
{
    using Microsoft.EntityFrameworkCore;
    using Microsoft.EntityFrameworkCore.Metadata.Builders;
    
    using Models;

    public class SeedRegionEntityConfiguration : IEntityTypeConfiguration<Region>
    {
        public void Configure(EntityTypeBuilder<Region> builder)
        {
            builder.HasData(this.CreateRegions());
        }

        private Region[] CreateRegions()
        {
            ICollection<Region> regions = new HashSet<Region>();

            Region region;

            region = new Region
            {
                Id = 1,
                Name = "Родопски Регион",
                Description = "Родопската фолклорна област преди е била включена като район от тракийската област. Обособяването ѝ като самостоятелна се е наложило от по-съществените различия между двете области.\r\n\r\nРодопските танци са бавни и умерени с малко разнообразие на движенията и сравнителна простота. Играят се най-често на песен, като характерно тук е, че мъжете също пеят.\r\n\r\nХора̀та се играят в полукръг или кръг и най-често са само мъжки или само женски. Срещат се и разделно-смесени хора, но при тях мъжете и жените не се нареждат един до друг мъж-жена, а в началото на хорото се хващат само мъжете, а след тях – жените.\r\n\r\nМъжете се залавят най-често за длани, което е много характерно за Родопите. В другите области този захват е много рядко срещан. Мъжете играят с широки стъпки, клякат и коленичат бавно и тромаво."
			};
            regions.Add(region);

            region = new Region
            {
	            Id = 72,
	            Name = "Шопски Регион",
	            Description = "Шопската фолклорна област има няколко района – софийски, граовски, кюстендилски, самоковски, ихтимански и годечки, в които има известни различия, въпреки общото в стила.\r\n\r\nТанцуването предизвиква силни преживявания в емоционалната душа на шопите, което се изразява в мощни провиквания, ръмжене и свиркане. Добре известно е движението „натрисане” – силно раздрусване на раменете, предизвикано от динамичните, твърди и отсечени движения в краката, както и от постановката на тялото и хвата за пояс. Високото повдигане на крака е проява на сила и мъжественост. Характерен е подчертаният стремеж за откъсване от земята."
			};
            regions.Add(region);

            region = new Region
            {
	            Id = 73,
	            Name = "Тракийски регион",
	            Description = "Обхваща Родопа планина.Тракийската фолклорна област обикновено се разделя на три района – западнотракийски, източнотракийски и странджански.\r\n\r\nМного от странджанските танци са във връзка с някакъв обред. Най-типични са нестинарските танци, великденските ръченици и кукерските игри. Странджанците играят с голяма съсредоточеност и сериозност. Мъжете респектират със сложни пляскания, а ръцете им излъчват сила и достойнство.\r\n\r\nАкцентът в тракийските танци е движението, насочено надолу – олицетворение на почитта към земята. В някои танци ясно се виждат заемки от битови трудови процеси като месене на хляб и точене на тесто. Тракиецът слива празника и делника в танца си, показвайки, че всеки ден е своеобразен празник.\r\n\r\n"
			};
            regions.Add(region);
			return regions.ToArray();
        }
    }
}
